ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_gpio_ctrl_regs.xml
<module id="GPIO_CTRL_REGS" HW_revision="" description="GPIO CTRL Registers">
	<register id="GPACTRL" width="32" page="1" offset="0x0" internal="0" description="GPIO A Qualification Sampling Period Control (GPIO0 to 31)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO0 to GPIO7" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO8 to GPIO15" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO16 to GPIO23" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO24 to GPIO31" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="GPAQSEL1" width="32" page="1" offset="0x2" internal="0" description="GPIO A Qualifier Select 1 Register (GPIO0 to 15)">
		<bitfield id="GPIO0" description="Select input qualification type for GPIO0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Select input qualification type for GPIO1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Select input qualification type for GPIO2" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Select input qualification type for GPIO3" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Select input qualification type for GPIO4" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Select input qualification type for GPIO5" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Select input qualification type for GPIO6" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Select input qualification type for GPIO7" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Select input qualification type for GPIO8" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Select input qualification type for GPIO9" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Select input qualification type for GPIO10" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Select input qualification type for GPIO11" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Select input qualification type for GPIO12" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Select input qualification type for GPIO13" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Select input qualification type for GPIO14" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Select input qualification type for GPIO15" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPAQSEL2" width="32" page="1" offset="0x4" internal="0" description="GPIO A Qualifier Select 2 Register (GPIO16 to 31)">
		<bitfield id="GPIO16" description="Select input qualification type for GPIO16" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Select input qualification type for GPIO17" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Select input qualification type for GPIO18" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Select input qualification type for GPIO19" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Select input qualification type for GPIO20" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Select input qualification type for GPIO21" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Select input qualification type for GPIO22" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Select input qualification type for GPIO23" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Select input qualification type for GPIO24" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Select input qualification type for GPIO25" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Select input qualification type for GPIO26" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Select input qualification type for GPIO27" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Select input qualification type for GPIO28" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Select input qualification type for GPIO29" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Select input qualification type for GPIO30" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Select input qualification type for GPIO31" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPAMUX1" width="32" page="1" offset="0x6" internal="0" description="GPIO A Mux 1 Register (GPIO0 to 15)">
		<bitfield id="GPIO0" description="Defines pin-muxing selection for GPIO0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Defines pin-muxing selection for GPIO1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Defines pin-muxing selection for GPIO2" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Defines pin-muxing selection for GPIO3" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Defines pin-muxing selection for GPIO4" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Defines pin-muxing selection for GPIO5" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Defines pin-muxing selection for GPIO6" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Defines pin-muxing selection for GPIO7" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Defines pin-muxing selection for GPIO8" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Defines pin-muxing selection for GPIO9" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Defines pin-muxing selection for GPIO10" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Defines pin-muxing selection for GPIO11" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Defines pin-muxing selection for GPIO12" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Defines pin-muxing selection for GPIO13" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Defines pin-muxing selection for GPIO14" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Defines pin-muxing selection for GPIO15" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPAMUX2" width="32" page="1" offset="0x8" internal="0" description="GPIO A Mux 2 Register (GPIO16 to 31)">
		<bitfield id="GPIO16" description="Defines pin-muxing selection for GPIO16" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Defines pin-muxing selection for GPIO17" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Defines pin-muxing selection for GPIO18" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Defines pin-muxing selection for GPIO19" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Defines pin-muxing selection for GPIO20" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Defines pin-muxing selection for GPIO21" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Defines pin-muxing selection for GPIO22" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Defines pin-muxing selection for GPIO23" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Defines pin-muxing selection for GPIO24" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Defines pin-muxing selection for GPIO25" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Defines pin-muxing selection for GPIO26" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Defines pin-muxing selection for GPIO27" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Defines pin-muxing selection for GPIO28" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Defines pin-muxing selection for GPIO29" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Defines pin-muxing selection for GPIO30" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Defines pin-muxing selection for GPIO31" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPADIR" width="32" page="1" offset="0xa" internal="0" description="GPIO A Direction Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPAPUD" width="32" page="1" offset="0xc" internal="0" description="GPIO A Pull Up Disable Register (GPIO0 to 31) ">
		<bitfield id="GPIO0" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
