ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_gpio_ctrl_regs.xml
	<register id="GPCQSEL1" width="32" page="1" offset="0x82" internal="0" description="GPIO C Qualifier Select 1 Register (GPIO64 to 79)">
		<bitfield id="GPIO64" description="Select input qualification type for GPIO64" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Select input qualification type for GPIO65" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Select input qualification type for GPIO66" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Select input qualification type for GPIO67" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Select input qualification type for GPIO68" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Select input qualification type for GPIO69" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Select input qualification type for GPIO70" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Select input qualification type for GPIO71" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Select input qualification type for GPIO72" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Select input qualification type for GPIO73" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Select input qualification type for GPIO74" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Select input qualification type for GPIO75" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Select input qualification type for GPIO76" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Select input qualification type for GPIO77" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Select input qualification type for GPIO78" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Select input qualification type for GPIO79" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCQSEL2" width="32" page="1" offset="0x84" internal="0" description="GPIO C Qualifier Select 2 Register (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Select input qualification type for GPIO80" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Select input qualification type for GPIO81" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCMUX1" width="32" page="1" offset="0x86" internal="0" description="GPIO C Mux 1 Register (GPIO64 to 79)">
		<bitfield id="GPIO64" description="Defines pin-muxing selection for GPIO64" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Defines pin-muxing selection for GPIO65" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Defines pin-muxing selection for GPIO66" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Defines pin-muxing selection for GPIO67" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Defines pin-muxing selection for GPIO68" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Defines pin-muxing selection for GPIO69" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Defines pin-muxing selection for GPIO70" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Defines pin-muxing selection for GPIO71" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Defines pin-muxing selection for GPIO72" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Defines pin-muxing selection for GPIO73" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Defines pin-muxing selection for GPIO74" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Defines pin-muxing selection for GPIO75" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Defines pin-muxing selection for GPIO76" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Defines pin-muxing selection for GPIO77" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Defines pin-muxing selection for GPIO78" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Defines pin-muxing selection for GPIO79" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCMUX2" width="32" page="1" offset="0x88" internal="0" description="GPIO C Mux 2 Register (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Defines pin-muxing selection for GPIO80" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines pin-muxing selection for GPIO81" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCDIR" width="32" page="1" offset="0x8a" internal="0" description="GPIO C Direction Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCPUD" width="32" page="1" offset="0x8c" internal="0" description="GPIO C Pull Up Disable Register (GPIO64 to 95) ">
		<bitfield id="GPIO64" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
