ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_gpio_ctrl_regs.xml
	<register id="GPCCR" width="32" page="1" offset="0xbe" internal="0" description="GPIO C Lock Commit Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGCTRL" width="32" page="1" offset="0x180" internal="0" description="GPIO G Qualification Sampling Period Control (GPIO192 to 223)">
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO208 to GPIO215" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="GPGQSEL2" width="32" page="1" offset="0x184" internal="0" description="GPIO G Qualifier Select 2 Register (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Select input qualification type for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Select input qualification type for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Select input qualification type for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Select input qualification type for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Select input qualification type for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Select input qualification type for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Select input qualification type for GPIO214" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Select input qualification type for GPIO215" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGMUX2" width="32" page="1" offset="0x188" internal="0" description="GPIO G Mux 2 Register (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Defines pin-muxing selection for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines pin-muxing selection for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines pin-muxing selection for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines pin-muxing selection for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines pin-muxing selection for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines pin-muxing selection for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Defines pin-muxing selection for GPIO214" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Defines pin-muxing selection for GPIO215" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGDIR" width="32" page="1" offset="0x18a" internal="0" description="GPIO G Direction Register (GPIO192 to 223)">
		<bitfield id="GPIO208" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGPUD" width="32" page="1" offset="0x18c" internal="0" description="GPIO G Pull Up Disable Register (GPIO192 to 223) ">
		<bitfield id="GPIO208" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
