ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_gpio_ctrl_regs.xml
	<register id="GPHPUD" width="32" page="1" offset="0x1cc" internal="0" description="GPIO H Pull Up Disable Register (GPIO224 to 255) ">
		<bitfield id="GPIO224" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHINV" width="32" page="1" offset="0x1d0" internal="0" description="GPIO H Input Polarity Invert Registers (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHODR" width="32" page="1" offset="0x1d2" internal="0" description="GPIO H Open Drain Output Register (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Outpout Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Outpout Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Outpout Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Outpout Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Outpout Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Outpout Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Outpout Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Outpout Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
