ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_gpio_ctrl_regs.xml
	<register id="GPHAMSEL" width="32" page="1" offset="0x1d4" internal="0" description="GPIO H Analog Mode Select register (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Analog Mode select for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Analog Mode select for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Analog Mode select for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Analog Mode select for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Analog Mode select for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Analog Mode select for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Analog Mode select for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Analog Mode select for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Analog Mode select for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Analog Mode select for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Analog Mode select for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Analog Mode select for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Analog Mode select for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Analog Mode select for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Analog Mode select for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Analog Mode select for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Analog Mode select for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Analog Mode select for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Analog Mode select for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Analog Mode select for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Analog Mode select for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Analog Mode select for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Analog Mode select for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Analog Mode select for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHGMUX1" width="32" page="1" offset="0x1e0" internal="0" description="GPIO H Peripheral Group Mux (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Defines pin-muxing selection for GPIO224" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Defines pin-muxing selection for GPIO225" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Defines pin-muxing selection for GPIO226" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Defines pin-muxing selection for GPIO227" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Defines pin-muxing selection for GPIO228" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Defines pin-muxing selection for GPIO229" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Defines pin-muxing selection for GPIO230" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Defines pin-muxing selection for GPIO231" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Defines pin-muxing selection for GPIO232" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Defines pin-muxing selection for GPIO233" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Defines pin-muxing selection for GPIO234" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Defines pin-muxing selection for GPIO235" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Defines pin-muxing selection for GPIO236" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Defines pin-muxing selection for GPIO237" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Defines pin-muxing selection for GPIO238" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Defines pin-muxing selection for GPIO239" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHGMUX2" width="32" page="1" offset="0x1e2" internal="0" description="GPIO H Peripheral Group Mux (GPIO240 to 255)">
		<bitfield id="GPIO240" description="Defines pin-muxing selection for GPIO240" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Defines pin-muxing selection for GPIO241" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Defines pin-muxing selection for GPIO242" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Defines pin-muxing selection for GPIO244" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Defines pin-muxing selection for GPIO245" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Defines pin-muxing selection for GPIO247" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Defines pin-muxing selection for GPIO248" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Defines pin-muxing selection for GPIO249" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Defines pin-muxing selection for GPIO251" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Defines pin-muxing selection for GPIO252" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Defines pin-muxing selection for GPIO253" begin="27" end="26" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL1" width="32" page="1" offset="0x1e8" internal="0" description="GPIO H Core Select Register (GPIO224 to 231)">
		<bitfield id="GPIO224" description="GPIO224 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO225" description="GPIO225 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO226" description="GPIO226 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO227" description="GPIO227 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO228" description="GPIO228 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO229" description="GPIO229 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO230" description="GPIO230 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO231" description="GPIO231 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
