ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_gpio_ctrl_regs.xml
	<register id="GPHCSEL2" width="32" page="1" offset="0x1ea" internal="0" description="GPIO H Core Select Register (GPIO232 to 239)">
		<bitfield id="GPIO232" description="GPIO232 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO233" description="GPIO233 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO234" description="GPIO234 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO235" description="GPIO235 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO236" description="GPIO236 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO237" description="GPIO237 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO238" description="GPIO238 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO239" description="GPIO239 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL3" width="32" page="1" offset="0x1ec" internal="0" description="GPIO H Core Select Register (GPIO240 to 247)">
		<bitfield id="GPIO240" description="GPIO240 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO241" description="GPIO241 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO242" description="GPIO242 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO244" description="GPIO244 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO245" description="GPIO245 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO247" description="GPIO247 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHCSEL4" width="32" page="1" offset="0x1ee" internal="0" description="GPIO H Core Select Register (GPIO248 to 255)">
		<bitfield id="GPIO248" description="GPIO248 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO249" description="GPIO249 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO251" description="GPIO251 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO252" description="GPIO252 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO253" description="GPIO253 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
	</register>
	<register id="GPHLOCK" width="32" page="1" offset="0x1fc" internal="0" description="GPIO H Lock Configuration Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCR" width="32" page="1" offset="0x1fe" internal="0" description="GPIO H Lock Commit Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO251" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO252" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO253" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
</module>
